%% 01 背包问题(01 Knapsack problem)
p = [540, 200, 180, 350, 60, 150, 280, 450, 320, 120];
w = [6, 3, 4, 5, 1, 2, 3, 5, 4, 2];
W = 30;
f = knapsack01problem1(p, w, W)
% f = 2410

%% 得到选择的物品编号
p = [11, 12, 10, 26, 14, 16];
w = [3, 2, 2, 5, 1, 3];
W = 10;
[f, IND] = knapsack01problem2(p, w, W)
% f = 62
% IND =  2     3     4     5

p = [540, 200, 180, 350, 60, 150, 280, 450, 320, 120];
w = [6, 3, 4, 5, 1, 2, 3, 5, 4, 2];
W = 30;
[f, IND] = knapsack01problem2(p, w, W)
% f = 2410
% IND = 1     2     4     6     7     8     9    10
